# StartPoint Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
LineLoad..::..StartPoint Property
LineLoad Class See Also
---
Returns the three dimensional location of the start point for the line load.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ StartPoint { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StartPoint As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ StartPoint {
	XYZ^ get ();
}
```

# Remarks
The location of the start point is measured in decimal feet.
# See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace